{
  "output_attentions": false,
  "output_hidden_states": false,
  "use_cache": true,
  "torchscript": false,
  "use_bfloat16": false,
  "pruned_heads": {},
  "is_encoder_decoder": false,
  "is_decoder": false,
  "max_length": 100,
  "min_length": 3,
  "do_sample": false,
  "early_stopping": false,
  "num_beams": 5,
  "temperature": 0.3,
  "top_k": 50,
  "top_p": 1.0,
  "repetition_penalty": 1.0,
  "length_penalty": 1.0,
  "no_repeat_ngram_size": 2,
  "bad_words_ids": null,
  "num_return_sequences": 5,
  "architectures": null,
  "finetuning_task": null,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1"
  },
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1
  },
  "prefix": null,
  "bos_token_id": 0,
  "pad_token_id": 1,
  "eos_token_id": 3,
  "decoder_start_token_id": null,
  "task_specific_params": null,
  "xla_device": null,
  "vocab_size": 52000,
  "n_ctx": 1024,
  "n_positions": 1024,
  "n_embd": 768,
  "n_layer": 12,
  "n_head": 12,
  "activation_function": "gelu_new",
  "resid_pdrop": 0.1,
  "embd_pdrop": 0.1,
  "attn_pdrop": 0.1,
  "layer_norm_epsilon": 1e-05,
  "initializer_range": 0.02,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "summary_activation": null,
  "summary_first_dropout": 0.1,
  "summary_proj_to_labels": true,
  "model_type": "gpt2"
}